Ran Plan for 2 projects:

1. project: `nonprod` dir: `.` workspace: `default`
1. project: `prod` dir: `.` workspace: `default`
---

### 1. project: `nonprod` dir: `.` workspace: `default`
**Plan Error**
```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/ryan-longoria/FeedMatrix/16/default/nonprod-default.tfplan" -var-file=tfvars/nonprod-ue2-animeutopia.tfvars -var-file=/home/atlantis/.atlantis/nonprod-ue2-animeutopia.tfvars' in '/home/atlantis/.atlantis/repos/ryan-longoria/FeedMatrix/16/default': exit status 1
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.

╷
│ Error: Failed to read variables file
│ 
│ Given variables file
│ /home/atlantis/.atlantis/nonprod-ue2-animeutopia.tfvars does not exist.
╵

```

---
### 2. project: `prod` dir: `.` workspace: `default`
<details><summary>Show Output</summary>

```diff
Wrote /home/atlantis/.atlantis/prod-ue2-animeutopia.tfvars with secrets from SSM.

data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=481665084477]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.workflow_schedule will be created
+ resource "aws_cloudwatch_event_rule" "workflow_schedule" {
      + arn                 = (known after apply)
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "anime_workflow_schedule"
      + name_prefix         = (known after apply)
      + schedule_expression = "rate(5 minutes)"
      + tags_all            = {
          + "DeployedBy" = "Terraform"
        }
    }

  # aws_cloudwatch_event_target.state_machine_target will be created
+ resource "aws_cloudwatch_event_target" "state_machine_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + role_arn       = (known after apply)
      + rule           = "anime_workflow_schedule"
      + target_id      = "StepFunctionStateMachine"
    }

  # aws_iam_policy.ec2_control_policy will be created
+ resource "aws_iam_policy" "ec2_control_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow Lambda functions to start and stop EC2 instances"
      + id               = (known after apply)
      + name             = "anime_ec2_control_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ec2:StartInstances",
                          + "ec2:StopInstances",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ec2:us-east-2:481665084477:instance/i-022e9bb5447996955"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy" = "Terraform"
        }
    }

  # aws_iam_policy.eventbridge_policy will be created
+ resource "aws_iam_policy" "eventbridge_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for CloudWatch Event to start Step Functions executions"
      + id               = (known after apply)
      + name             = "eventbridge_step_functions_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy" = "Terraform"
        }
    }

  # aws_iam_policy.sns_publish_policy will be created
+ resource "aws_iam_policy" "sns_publish_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow Lambda functions to publish to SNS topics for notifications"
      + id               = (known after apply)
      + name             = "anime_sns_publish_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy" = "Terraform"
        }
    }

  # aws_iam_policy.ssm_send_command_policy will be created
+ resource "aws_iam_policy" "ssm_send_command_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy to allow Lambda functions to send SSM commands on EC2 instances"
      + id               = (known after apply)
      + name             = "anime_ssm_send_command_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ssm:SendCommand"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy" = "Terraform"
        }
    }

  # aws_iam_policy.step_functions_policy will be created
+ resource "aws_iam_policy" "step_functions_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for Step Functions to invoke Lambda functions"
      + id               = (known after apply)
      + name             = "anime_step_functions_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = {
          + "DeployedBy" = "Terraform"
        }
    }

  # aws_iam_role.eventbridge_role will be created
+ resource "aws_iam_role" "eventbridge_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eventbridge_step_functions_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy" = "Terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.lambda_role will be created
+ resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "anime_lambda_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy" = "Terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role.step_functions_role will be created
+ resource "aws_iam_role" "step_functions_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "states.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "anime_step_functions_role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "DeployedBy" = "Terraform"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.attach_ec2_control_policy will be created
+ resource "aws_iam_role_policy_attachment" "attach_ec2_control_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "anime_lambda_role"
    }

  # aws_iam_role_policy_attachment.attach_eventbridge_policy will be created
+ resource "aws_iam_role_policy_attachment" "attach_eventbridge_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "eventbridge_step_functions_role"
    }

  # aws_iam_role_policy_attachment.attach_sns_publish_policy will be created
+ resource "aws_iam_role_policy_attachment" "attach_sns_publish_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "anime_lambda_role"
    }

  # aws_iam_role_policy_attachment.attach_ssm_send_command_policy will be created
+ resource "aws_iam_role_policy_attachment" "attach_ssm_send_command_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "anime_lambda_role"
    }

  # aws_iam_role_policy_attachment.attach_step_functions_policy will be created
+ resource "aws_iam_role_policy_attachment" "attach_step_functions_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "anime_step_functions_role"
    }

  # aws_iam_role_policy_attachment.lambda_basic_execution will be created
+ resource "aws_iam_role_policy_attachment" "lambda_basic_execution" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "anime_lambda_role"
    }

  # aws_lambda_function.fetch_rss will be created
+ resource "aws_lambda_function" "fetch_rss" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/AnimeUtopia/fetch_rss/fetch_rss.zip"
      + function_name                  = "fetch_rss"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.notify_post will be created
+ resource "aws_lambda_function" "notify_post" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/AnimeUtopia/notify_post/notify_post.zip"
      + function_name                  = "notify_post"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.process_content will be created
+ resource "aws_lambda_function" "process_content" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/AnimeUtopia/process_content/process_content.zip"
      + function_name                  = "process_content"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-2:481665084477:layer:imagick-layer:1",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "IMAGE_MAGICK_EXE" = "/opt/bin/magick"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.render_video will be created
+ resource "aws_lambda_function" "render_video" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/AnimeUtopia/render_video/render_video.zip"
      + function_name                  = "render_video"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 20
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "INSTANCE_ID" = "i-022e9bb5447996955"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.save_video will be created
+ resource "aws_lambda_function" "save_video" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/AnimeUtopia/save_video/save_video.zip"
      + function_name                  = "save_video"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 20
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "INSTANCE_ID"   = "i-022e9bb5447996955"
              + "TARGET_BUCKET" = "prod-animeutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.start_instance will be created
+ resource "aws_lambda_function" "start_instance" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/AnimeUtopia/start_instance/start_instance.zip"
      + function_name                  = "start_instance"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "EC2_INSTANCE_ID" = "i-022e9bb5447996955"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.stop_instance will be created
+ resource "aws_lambda_function" "stop_instance" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/AnimeUtopia/stop_instance/stop_instance.zip"
      + function_name                  = "stop_instance"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "EC2_INSTANCE_ID" = "i-022e9bb5447996955"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.store_data will be created
+ resource "aws_lambda_function" "store_data" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "./artifacts/scripts/AnimeUtopia/store_data/store_data.zip"
      + function_name                  = "store_data"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.9"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "DeployedBy" = "Terraform"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUCKET_NAME" = "prod-animeutopia-media-bucket"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_s3_bucket.media_bucket will be created
+ resource "aws_s3_bucket" "media_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "prod-animeutopia-media-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "prod"
          + "Name"        = "AnimeMediaBucket"
        }
      + tags_all                    = {
          + "DeployedBy"  = "Terraform"
          + "Environment" = "prod"
          + "Name"        = "AnimeMediaBucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }

      + website (known after apply)
    }

  # aws_sfn_state_machine.anime_workflow will be created
+ resource "aws_sfn_state_machine" "anime_workflow" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "anime_workflow"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = (known after apply)
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = {
          + "DeployedBy" = "Terraform"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration (known after apply)

      + tracing_configuration (known after apply)
    }

  # aws_sns_topic.anime_notifications will be created
+ resource "aws_sns_topic" "anime_notifications" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "anime_post_notifications"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "DeployedBy" = "Terraform"
        }
      + tracing_config              = (known after apply)
    }

  # aws_sns_topic_subscription.anime_subscription will be created
+ resource "aws_sns_topic_subscription" "anime_subscription" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = "kk47mgmt@outlook.com"
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "email"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

Plan: 28 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ s3_bucket_name    = "prod-animeutopia-media-bucket"
+ state_machine_arn = (known after apply)
╷
│ Warning: Argument is deprecated
│ 
│   with aws_s3_bucket.media_bucket,
│   on main.tf line 8, in resource "aws_s3_bucket" "media_bucket":
│    8: resource "aws_s3_bucket" "media_bucket" {
│ 
│ Use the aws_s3_bucket_versioning resource instead
│ 
│ (and 3 more similar warnings elsewhere)
╵
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://18.217.82.45:4141/lock?id=ryan-longoria%252FFeedMatrix%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 28 to add, 0 to change, 0 to destroy.

---
### Plan Summary

2 projects, 1 with changes, 0 with no changes, 1 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```